Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.GetAllExcludePartsAccordingToFilter Method
 Retrieves all the possible valid filters for ExcludePartsAccordingToFilter.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> GetAllExcludePartsAccordingToFilter()
Public Shared Function GetAllExcludePartsAccordingToFilter As List(Of String)
Return Value
Type: List<String>
A list of string that correspond to the filters available.
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace